InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_БитТелефонияНастройкиУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>бит_БитТелефонияНастройкиУЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗвонокИзКарточкиМероприятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТелефонии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БлокироватьВводНомераБитФон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БлокироватьВводНомераБитМонитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКонтрагента</Name>
					<Comment>Уникальный код контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзывПерсональныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_ПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Действующее</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Реестр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеОБанкротстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТелефона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретЗвонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГорода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавочный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФИО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОператора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Comment>Трейд Софт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаниеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтслеживаниеИзменений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСправочникРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/бит_ТелефонияСерверПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Общий серверный модуль телефонии БИТ
// Содержит функции, реализация которых зависит от конфигурации.
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

//-----------------------------------------------------------------------------
// === УТ 10.3 ===

// Возвращает булево - признак хранения контактной информации в регистре сведений (иначе в табличной части справочников контрагентов и контактных лиц).
Функция КонтактнаяИнформацияВРегистреСведений() ЭКСПОРТ
	Возврат Ложь;
КонецФункции

// Возвращает строку, имя справочника контрагентов
Функция ПолучитьИмяСправочникаКонтрагентов() ЭКСПОРТ
	Возврат "Контрагенты";
КонецФункции

// Возвращает строку, имя справочника контактных лиц
Функция ПолучитьИмяСправочникаКонтактныхЛиц() ЭКСПОРТ
	Возврат "КонтактныеЛицаПоДолжнику";
КонецФункции

// Возвращает строку, имя справочника сотрудников
Функция ПолучитьИмяСправочникаСотрудников() ЭКСПОРТ
	Возврат "Пользователи";
КонецФункции

// Возвращает строку, имя документа - события взаимодействия.
Функция ПолучитьИмяДокументаСобытие() ЭКСПОРТ
	Возврат "ТелефонныйЗвонок";
КонецФункции

// Возвращает таблицу значений с полями контрагентов и контактных лиц.
Функция НайтиКонтрагентовПоНомеруВКонтактах(НомерДляПоиска, флагТолькоПервый) ЭКСПОРТ
	//таблК = Новый ТаблицаЗначений;
	//таблК.Колонки.Добавить("Контрагент");
	//таблК.Колонки.Добавить("КонтактноеЛицо");
	//
	Если НЕ ЗначениеЗаполнено(НомерДляПоиска) ИЛИ бит_БИТфонСервер.ПолучитьФлагНеИскатьКонтрагента() Тогда
		КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка();
		таблК = Новый ТаблицаЗначений;
		таблК.Колонки.Добавить("Контрагент");
		таблК.Колонки.Добавить("КонтактноеЛицо");
		
		ПустаяСтрока = таблК.Добавить();
		ПустаяСтрока.Контрагент = КонтрагентСсылка;
		
		Возврат таблК;

	КонецЕсли;

	
	длинаНомера = СтрДлина(НомерДляПоиска);
	стрПодобия = "%";
	Для й = 1 ПО длинаНомера Цикл
		стрПодобия = стрПодобия + Сред(НомерДляПоиска, й, 1) + "%";
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыТелефоны.Ссылка КАК Контрагент,
		|	ВЫБОР
		|		КОГДА КонтрагентыТелефоны.КонтактноеЛицо = ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПоДолжнику.ПустаяСсылка)
		|			ТОГДА КонтрагентыТелефоны.Ссылка
		|		ИНАЧЕ КонтрагентыТелефоны.КонтактноеЛицо.Ссылка
		|	КОНЕЦ КАК КонтактноеЛицо
		|ИЗ
		|	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
		|ГДЕ
		|	ВЫРАЗИТЬ(КонтрагентыТелефоны.НомерДляПоиска КАК СТРОКА) ПОДОБНО &НомерТелефона";
	
	Запрос.УстановитьПараметр("НомерТелефона", "%" + стрПодобия + "%");
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
КонецФункции

// Возвращает массив строк номеров контрагента
Функция НайтиНомераКонтрагента(КонтрагентСсылка) ЭКСПОРТ
	Возврат НайтиКонтактнуюИнформацию(КонтрагентСсылка, Неопределено);
КонецФункции

// Возвращает строку - номер контрагента по виду контактной информации
Функция НайтиНомерКонтрагента(КонтрагентСсылка, ВидКонтактнойИнформации) ЭКСПОРТ
	номер = "";
	массивНомеров = НайтиКонтактнуюИнформацию(КонтрагентСсылка, ВидКонтактнойИнформации);
	Если массивНомеров.Количество() > 0 Тогда
		номер = массивНомеров[0];
	КонецЕсли;
	Возврат номер;
КонецФункции

// Возвращает массив видов телефонов
Функция ПолучитьВидыКонтактнойИнформацииКонтрагента() ЭКСПОРТ
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВидыТелефонов.Ссылка КАК Вид
	|ИЗ
	|	Справочник.ВидыТелефонов КАК ВидыТелефонов");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вид");
	
КонецФункции

// Возвращает массив строк номеров контрактного лица
Функция НайтиНомераКонтактногоЛица(КонтактноеЛицоСсылка) ЭКСПОРТ
	Возврат НайтиКонтактнуюИнформацию(КонтактноеЛицоСсылка, Неопределено);
КонецФункции

// Возвращает ссылку на контрагента по его контактному лицу
Функция ПолучитьКонтрагентаКонтактногоЛица(КонтактноеЛицоСсылка) ЭКСПОРТ
	Если ТипЗнч(КонтактноеЛицоСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат КонтактноеЛицоСсылка;
	Иначе	
		Возврат КонтактноеЛицоСсылка.Владелец;
	КонецЕсли;
КонецФункции

// Возвращает массив ссылок на контактных лиц контрагента
Функция НайтиКонтактныеЛицаКонтрагента(КонтрагентСсылка) ЭКСПОРТ
	массКонтактныеЛица = Новый Массив();
	Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					   |	КонтактныеЛицаКонтрагентов.Ссылка
					   |ИЗ
					   |	Справочник." + ПолучитьИмяСправочникаКонтактныхЛиц() + " КАК КонтактныеЛицаКонтрагентов
					   |ГДЕ
					   |	КонтактныеЛицаКонтрагентов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", КонтрагентСсылка);
		массКонтактныеЛица = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	Возврат массКонтактныеЛица;
КонецФункции

// Возвращает массив строк номеров сотрудника
Функция НайтиНомераСотрудника(СотрудникСсылка) ЭКСПОРТ
	Возврат НайтиКонтактнуюИнформацию(СотрудникСсылка, Неопределено);
КонецФункции

// Возвращает ссылку на элемент справочника Пользователи
Функция ПолучитьОсновногоМенеджераКонтрагента(контрагентСсылка) ЭКСПОРТ
	менеджерСсылка = Неопределено;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь
	                      |ИЗ
	                      |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |ГДЕ
	                      |	ОтветственныеСотрудники.Объект = &Объект
	                      |	И ОтветственныеСотрудники.ТипСотрудника = &ТипСотрудника");
	Запрос.УстановитьПараметр("ТипСотрудника", Константы.ТипСотрудникаКлиентМенеджер.Получить());
	Запрос.УстановитьПараметр("Объект", Справочники.ДолговыеОбязательства.НайтиПоРеквизиту("Должник", контрагентСсылка));
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		менеджерСсылка =  Результат.Пользователь;
	Иначе
		менеджерСсылка =  ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

	Возврат менеджерСсылка;
КонецФункции

Функция ПолучитьКонтактСобытия(ссылкаСобытие, стрСообщениеОбОшибкеВозвращ) ЭКСПОРТ
	стрСообщениеОбОшибкеВозвращ = "";
	контакт = "";
	Если ЗначениеЗаполнено(ссылкаСобытие) Тогда
		Если (ссылкаСобытие.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок) Тогда
			Если ЗначениеЗаполнено(ссылкаСобытие.КонтактноеЛицо) Тогда
				контакт = ссылкаСобытие.КонтактноеЛицо;
			Иначе
				контакт = ссылкаСобытие.Контрагент;
				Если ТипЗнч(контакт) = Тип("Строка") Тогда
					// проверка Избранного
					индИзбр = Найти(контакт, " (избранное)");
					Если индИзбр > 0 Тогда
						наименИзбр = Лев(контакт, индИзбр-1);
						контакт = бит_ТелефонияСервер.ИзбранноеНайтиНомер(наименИзбр);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			стрСообщениеОбОшибкеВозвращ = "Вид события должен быть Телефонный звонок";
		КонецЕсли;
	Иначе
		стрСообщениеОбОшибкеВозвращ = "Документ должен быть записан перед вызовом команды";
	КонецЕсли;
	Возврат контакт;
КонецФункции

Процедура ЗаписатьНомерТелефонаКонтрагента(контрагентСсылка, видКонтактнойИнформацииСсылка, стрНомер) ЭКСПОРТ
		
	Если НЕ ЗначениеЗаполнено(контрагентСсылка) Тогда
		Возврат;
	КонецЕсли;

	обКонтрагент = контрагентСсылка.ПолучитьОбъект();
	строка = обКонтрагент.Телефоны.Добавить();
	строка.ВидТелефона = видКонтактнойИнформацииСсылка;
	строка.Номер = стрНомер;
	УдалитьУправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(строка, стрНомер);
	обКонтрагент.Записать();
КонецПроцедуры

// Возвращает ссылку на новый созданный документ события взаимодействия
Функция СоздатьСобытиеЗвонка(структПараметры) ЭКСПОРТ
	
	// Необновляемая область
	
	ДокументСобытие = Задачи.Мероприятие.СоздатьЗадачу();	
	
	// Выбрать актуальное ДО в случае совпадений по кредитору
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолговыеОбязательства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	|ГДЕ
	|	ДолговыеОбязательства.Должник = &Должник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";
	//
		
	Запрос.УстановитьПараметр("Должник", структПараметры.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДокументСобытие.Объект = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		ДокументСобытие.Объект = структПараметры.Контрагент;
	КонецЕсли;
	
	//
	
	Если ЗначениеЗаполнено(структПараметры.КонтактноеЛицо) Тогда
		ДокументСобытие.КонтактноеЛицо = структПараметры.КонтактноеЛицо;
	КонецЕсли;
			
	ДокументСобытие.Дата = ТекущаяДата();
	ДокументСобытие.ПланируемаяДата = ТекущаяДата();
	ДокументСобытие.ПланируемоеВремя = ТекущаяДата();
	ДокументСобытие.Контакт = структПараметры.Номер;


	
	ДокументСобытие.Комментарий = "";
	Если структПараметры.Входящий Тогда //ДокументСобытие.Входящий Тогда
		ДокументСобытие.ТипМероприятия = Справочники.ТипыМероприятий.ТелефонныйЗвонокВходящий;
		// ДокументСобытие.Комментарий = "Входящий звонок с " + структПараметры.Номер;
		// Передать в комментарий номер вхоядщего звонка
		ДокументСобытие.Комментарий = структПараметры.Номер;
	Иначе
		ДокументСобытие.ТипМероприятия = Справочники.ТипыМероприятий.ТелефонныйЗвонокИсходящий;
		// ДокументСобытие.Комментарий = "Исходящий звонок на " + структПараметры.Номер;
	КонецЕсли;
	
	ДокументСобытие.бтЗаписьРазговора = структПараметры.ЗаписьРазговора;
	//++КазанцевЯА-БП
	Если Константы.КонтрольСроковМероприятий.Получить() И ДокументСобытие.ТипМероприятия.СрокВыполнения > 0 Тогда 
		ДокументСобытие.СрокВыполнения =  ТекущаяДата() + ДокументСобытие.ТипМероприятия.СрокВыполнения * 60;
		ОсновнойКалендарьПредприятия = Константы.ОсновнойКалендарьПредприятия.Получить();
		Если Константы.ПереноситьВыходныеИПраздникиМероприятий.Получить() И ЗначениеЗаполнено(ОсновнойКалендарьПредприятия) Тогда
			УстановитьПривилегированныйРежим(Истина);
			ПроизводственныйКалендарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнойКалендарьПредприятия, "ПроизводственныйКалендарь");
			ПараметрыПолучения = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат();
			ПараметрыПолучения.ПолучатьПредшествующие = Ложь;
			ПараметрыПолучения.ВызыватьИсключение = Ложь;
			свДата = НачалоДня(ДокументСобытие.СрокВыполнения);
			свВремя =  ДокументСобытие.СрокВыполнения - свДата;
			мСрокВыполнения = Новый Массив;
			мСрокВыполнения.Добавить(свДата);
			ДниКалендаря = КалендарныеГрафики.БлижайшиеРабочиеДаты(ПроизводственныйКалендарь, мСрокВыполнения, ПараметрыПолучения);
			Если ЗначениеЗаполнено(ДниКалендаря) Тогда
				ДокументСобытие.СрокВыполнения = ДниКалендаря.Получить(свДата) + свВремя;  
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось установить срок мероприятия, возможно не заполнен календарь";
				Сообщение.Сообщить();  
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);	
		КонецЕсли;
	КонецЕсли;
	//--КазанцевЯА-БП

	//Лебедева
	ДокументСобытие.Ответственный = ПараметрыСеанса.ТекущийПользователь;

	ДокументСобытие.Записать();

	Возврат ДокументСобытие.Ссылка;
	
КонецФункции

// Проверяет возможность автозапуска при начале работы системы
Функция ЕстьВозможностьАвтозапуска() ЭКСПОРТ
	Возврат Истина;
КонецФункции

// проверяет что заданный контрагент является покупателем
Функция ПроверкаКонтрагентПокупатель(контрагентСсылка) ЭКСПОРТ
	покупатель = Ложь;
	Если ТипЗнч(контрагентСсылка) = Тип("СправочникСсылка." + ПолучитьИмяСправочникаКонтрагентов()) Тогда
		покупатель = контрагентСсылка.Покупатель;
	КонецЕсли;
	Возврат покупатель;
КонецФункции

// проверяет что заданный контрагент является поставщиком
Функция ПроверкаКонтрагентПоставщик(контрагентСсылка) ЭКСПОРТ
	поставщик = Ложь;
	Если ТипЗнч(контрагентСсылка) = Тип("СправочникСсылка." + ПолучитьИмяСправочникаКонтрагентов()) Тогда
		поставщик = контрагентСсылка.Поставщик;
	КонецЕсли;
	Возврат поставщик;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиКонтактнуюИнформацию(СсылкаНаОбъект, ВидКонтактнойИнформации)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтрагентыТелефоны.Ссылка,
	                      |	КонтрагентыТелефоны.Номер КАК НомерТелефона
	                      |ИЗ
	                      |	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
	                      |ГДЕ
	                      |	КонтрагентыТелефоны.Ссылка = &Ссылка
	                      |	И КонтрагентыТелефоны.ВидТелефона = &ДопСвойство");
	
	Если ВидКонтактнойИнформации = Неопределено Тогда
		Запрос.Текст = ("ВЫБРАТЬ
		                |	КонтрагентыДополнительныеРеквизиты.Значение КАК НомерТелефона
		                |ПОМЕСТИТЬ Таб
		                |ИЗ
		                |	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		                |ГДЕ
		                |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Ссылка
		                |	И КонтрагентыДополнительныеРеквизиты.Свойство.ВидКИ = &Тип
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ДополнительныеСведения.Значение
		                |ИЗ
		                |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		                |ГДЕ
		                |	ДополнительныеСведения.Объект = &Ссылка
		                |	И ДополнительныеСведения.Свойство.ВидКИ = &Тип
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	КонтрагентыТелефоны.Номер
		                |ИЗ
		                |	Справочник.Контрагенты.Телефоны КАК КонтрагентыТелефоны
		                |ГДЕ
		                |	КонтрагентыТелефоны.Ссылка = &Ссылка
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	Таб.НомерТелефона
		                |ИЗ
		                |	Таб КАК Таб
		                |ГДЕ
		                |	Таб.НомерТелефона <> """"");
			
	КонецЕсли;
	
	Если  ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Пользователи") Тогда
		  ВидКонтактнойИнформации = Константы.ТелефонныйНомерПользователя.Получить();
		  Запрос.Текст = ("ВЫБРАТЬ
		                  |	ДополнительныеСведения.Значение КАК НомерТелефона,
		                  |	ДополнительныеСведения.Объект КАК Объект
		                  |ИЗ
		                  |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		                  |ГДЕ
		                  |	ДополнительныеСведения.Свойство = &допСвойство
		                  |	И ДополнительныеСведения.Объект = &Ссылка
		                  |
		                  |ОБЪЕДИНИТЬ
		                  |
		                  |ВЫБРАТЬ
		                  |	ПользователиДополнительныеРеквизиты.Значение,
		                  |	ПользователиДополнительныеРеквизиты.Ссылка
		                  |ИЗ
		                  |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
		                  |ГДЕ
		                  |	ПользователиДополнительныеРеквизиты.Свойство = &допСвойство
		                  |	И ПользователиДополнительныеРеквизиты.Ссылка = &Ссылка");
	КонецЕсли;	
	
		
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("допСвойство", ВидКонтактнойИнформации);
	Запрос.УстановитьПараметр("Тип", Справочники.ВидыКИ.Телефон);
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерТелефона");

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейсУЗ

//-----------------------------------------------------------------------------
// === Управление Задолженностью ===

Функция ПолучитьВидТелефонии() ЭКСПОРТ
	Пользователь = бит_ТелефонияСервер.ПолучитьТекущегоПользователя();
	СтруктураОтбора = Новый Структура("Пользователь", Пользователь);
	Возврат РегистрыСведений.бит_БитТелефонияНастройкиУЗ.Получить(СтруктураОтбора).ЗвонокИзКарточкиМероприятия;	
КонецФункции

&НаСервере
Функция ПолучитьВидыКонтрагентов() ЭКСПОРТ
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЮрФизЛицо.Ссылка КАК Вид
	                      |ИЗ
	                      |	Справочник.ЮрФизЛицо КАК ЮрФизЛицо");
	списокВидовКонтрагентов = Новый СписокЗначений();
	списокВидовКонтрагентов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вид"));
	Возврат списокВидовКонтрагентов;
КонецФункции

&НаСервере
Функция ПолучитьВидыТелефонныхНомеров() ЭКСПОРТ
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыТелефонов.Ссылка КАК Вид
	                      |ИЗ
	                      |	Справочник.ВидыТелефонов КАК ВидыТелефонов
	                      |ГДЕ
	                      |	ВидыТелефонов.ПометкаУдаления = ЛОЖЬ");
	списокВидовТелефонов = Новый СписокЗначений();
	списокВидовТелефонов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вид"));
	Возврат списокВидовТелефонов;
КонецФункции


&НаСервере
Функция ПолучитьСписокРеквизитовКонтрагента(типКонтрагента) ЭКСПОРТ
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЮрФизЛицоДополнительныеРеквизиты.Свойство КАК Вид
	                      |ИЗ
	                      |	Справочник.ЮрФизЛицо.ДополнительныеРеквизиты КАК ЮрФизЛицоДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ЮрФизЛицоДополнительныеРеквизиты.Ссылка = &типКонтрагента
	                      |	И ЮрФизЛицоДополнительныеРеквизиты.Свойство.ВидКИ = &ВидКИ");
	Запрос.УстановитьПараметр("типКонтрагента", типКонтрагента);
	Запрос.УстановитьПараметр("ВидКИ", Справочники.ВидыКИ.Телефон);
	списокВидовКонтактнойИнформации = Новый СписокЗначений();
	списокВидовКонтактнойИнформации.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вид"));
	Возврат списокВидовКонтактнойИнформации;
КонецФункции

Функция ПолучитьФлагБлокироватьВводНомераБитМонитор() ЭКСПОРТ
	Пользователь = бит_ТелефонияСервер.ПолучитьТекущегоПользователя();
	СтруктураОтбора = Новый Структура("Пользователь", Пользователь);
	Возврат РегистрыСведений.бит_БитТелефонияНастройкиУЗ.Получить(СтруктураОтбора).БлокироватьВводНомераБитМонитор;
КонецФункции

Функция ПолучитьФлагБлокироватьВводНомераБитФон() ЭКСПОРТ
	Пользователь = бит_ТелефонияСервер.ПолучитьТекущегоПользователя();
	СтруктураОтбора = Новый Структура("Пользователь", Пользователь);
	Возврат РегистрыСведений.бит_БитТелефонияНастройкиУЗ.Получить(СтруктураОтбора).БлокироватьВводНомераБитФон;
КонецФункции

Процедура ЗадатьНомерТелефонаКонтрагентаМер(контрагент, НомерТел, ВидТел) ЭКСПОРТ
	Если НЕ ЗначениеЗаполнено(контрагент) Тогда
		Возврат;
	КонецЕсли;

	обКонтрагент = контрагент.ПолучитьОбъект();
	строка = обКонтрагент.Телефоны.Добавить();
	строка.ВидТелефона = ВидТел;
	строка.Номер = НомерТел;
	УдалитьУправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(строка, НомерТел);
	обКонтрагент.Записать();
КонецПроцедуры

#КонецОбласти
